import React, {useState} from 'react';

import Question from './Question';

const faq = [
    {id:1, title: 'فروشگاه شما از چه سالی فعالیتش را شروع کرد؟', text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم'},
    {id:2, title: 'فروشگاه شما چه نوع محصولاتی را می فروشد؟', text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم'},
    {id:3, title: 'فروشگاه شما مواد محصولاتش را از کجا وارد می کند؟', text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم'},
    {id:4, title: 'فروشگاه شما در چه شهرهایی شعبه دارد؟', text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم'},
    {id:5, title: 'فروشگاه شما مشتریان خارجی هم دارد؟', text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم'},
]
const Questions = () => {
    const [faqId, setFaqId] = useState(1)
    return (
        <div className='w-[90%] md:w-[700px] lg:w-[920px] xl:w-[1000px] mx-auto py-24'>
            {faq.map(question => 
                <Question 
                    key={question.id} 
                    {...question} 
                    faqId={faqId} 
                    setFaqId={setFaqId}/>
                )}
        </div>
    );
};

export default Questions;