import React from 'react';
import Rule from './Rule';

const rules = [
    {id:1, title: 'فروشگاه شما از چه سالی پرداخت مالیات را شروع کرد؟', text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم'},
    {id:2, title: 'فروشگاه شما چه نوع مالیاتی را می پردازد؟', text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم'},
    {id:3, title: 'فروشگاه شما مواد محصولاتش را از کجا وارد می کند؟', text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم'},
    {id:4, title: 'فروشگاه شما در چه شهرهایی شعبه مالیاتی دارد؟', text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم'},
    {id:5, title: 'فروشگاه شما برای مشتریان خارجی هم مالیات می پردازد؟', text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم'},
]
const Rules = () => {
    return (
        <div className='w-[90%] md:w-[700px] lg:w-[920px] xl:w-[1000px] mx-auto py-24'>
            {rules.map(rule => 
                <Rule
                    key={rule.id} 
                    {...rule} 
                />
                )}
        </div>
    );
};

export default Rules;