import React from 'react';

const terms = [
    {id:1, text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم, پس لبا در کنار ما باش و لذت ببر'},
    {id:2, text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم, پس لبا در کنار ما باش و لذت ببر'},
    {id:3, text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم, پس لبا در کنار ما باش و لذت ببر'},
    {id:4, text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم, پس لبا در کنار ما باش و لذت ببر'},
    {id:5, text: 'امروز روز خوبی است و ما در حال رفتن به کوه هستیم و می خواهیم در کنار هم لذت ببریم, هوا هم خوب است و ما به زودی قرار است برای نهار کباب کوبیده درست کنیم و لذت ببریم, پس لبا در کنار ما باش و لذت ببر'},
]
const Terms = () => {
    return (
        <div className='w-[90%] md:w-[700px] lg:w-[920px] xl:w-[1000px] mx-auto py-24'>
            {terms.map(term => 
                <div key={term.id}>
                <p className="text-slate-500 mt-6">
                    {term.text}
                </p>
                <p className="text-slate-500 mt-4">
                    {term.text}
                </p>
            </div>
            )}
        </div>
    );
};

export default Terms;